<?php

return [
    /*
    |--------------------------------------------------------------------------
    | Адрес API Finder
    |--------------------------------------------------------------------------
    |
    | Адрес сервиса apifinder.ru для работы с API
    | Используется для отправки запросов к API
    |
    */
    'base_url' => env('APIFINDER_BASE_URL', 'https://apifinder.ru'),

    /*
    |--------------------------------------------------------------------------
    | API токен
    |--------------------------------------------------------------------------
    |
    | Специальный Bearer token для авторизации в сервисе API Finder
    | Можно получить в панели управления на сайте apifinder.ru
    |
    */
    'api_token' => env('APIFINDER_API_TOKEN'),

    /*
    |--------------------------------------------------------------------------
    | Максимальное время ответа
    |--------------------------------------------------------------------------
    |
    | Время ожидания по умолчанию в секундах для запросов к API
    |
    */
    'timeout' => env('APIFINDER_TIMEOUT', 30),

    /*
    |--------------------------------------------------------------------------
    | Guzzle HTTP Client Options
    |--------------------------------------------------------------------------
    |
    | Дополнительные опции для передачи HTTP-клиенту Guzzle
    | Полезно для настройки прокси-серверов, проверки SSL и т.д.
    |
    */
    'guzzle_options' => [
        // 'proxy' => env('AGGREGATOR_API_PROXY'),
        // 'verify' => env('AGGREGATOR_API_SSL_VERIFY', true),
    ],
];